app/Models/ArticulosModel.php

SELECT *
FROM `articulos`
---
      public function getArticulos()
      {
          return $this->findAll();